app/views/services/show.html.erb

    <div style="width:56px; height:56px; background:var(--primary-light); border-radius:50%; display:flex; align-items:center; justify-content:center; margin:0 auto 12px; font-size:22px; font-weight:700; color:var(--primary);">
      <%= @service.user.name.first.upcase %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1