app/views/pages/profile.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---

<p>Your balance: <%= User.find(session[:user_id]).balance %></p>