app/controllers/services_controller.rb

  def index
    @services = Service.includes(:user).order(created_at: :desc)
---
SELECT "services".* FROM "services" ORDER BY "services"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)

  def create
    @service = Service.new(service_params)
    @service.user = current_user

    if @service.save
---
INSERT INTO "services" ("created_at", "description", "title", "updated_at", "user_id", "duration") VALUES ('2026-04-22 21:34:36.043559', 'a', 'asd', '2026-04-22 21:34:36.043559', 1, 1) RETURNING "id"

  def destroy
    @service.destroy
---
DELETE FROM "services" WHERE "services"."id" = 3

  def set_service
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = 1 LIMIT 1