app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'izabelamartirosyan777@gmail.com' LIMIT 1
---
  def create
    user = User.find_by(email: params[:email].to_s.downcase.strip)