app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    user.balance = 10
    user.role = "user"

    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "role", "balance", "created_at", "updated_at") VALUES ('bella', 'izabelamartirosyan777@gmail.com', '$2a$12$DKIT0uX6iFaXCBpksFjIcehhFqMqVA3GHOrml8wfUrNKaSksLTQYC', 'user', 10, '2026-03-26 06:37:14.108775', '2026-03-26 06:37:14.108775') RETURNING "id"